VPro/src/Enums/MobileApplicationProfiles/MobileApplicationProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MobileApplicationProfiles</name>
  <enumValues>
    <name>Owner</name>
  </enumValues>
  <enumValues>
    <name>SalesRepresentative</name>
  </enumValues>
  <enumValues>
    <name>ServiceEngineer</name>
  </enumValues>
  <enumValues>
    <name>Seller</name>
  </enumValues>
  <enumValues>
    <name>RetailPoint</name>
  </enumValues>
  <enumValues>
    <name>DetailedSetting</name>
  </enumValues>
  <enumValues>
    <name>MobileTelephony</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/MobileApplicationProfiles/ManagerModule.bsl
Function ProfilePresentation(Profile) Export
	
	If Profile = Enums.MobileApplicationProfiles.Owner Then
		Return "Owner";
	ElsIf Profile = Enums.MobileApplicationProfiles.SalesRepresentative Then
		Return "SalesRepresentative";
	ElsIf Profile = Enums.MobileApplicationProfiles.ServiceEngineer Then
		Return "ServiceEngineer";
	ElsIf Profile = Enums.MobileApplicationProfiles.Seller Then
		Return "Seller";
	ElsIf Profile = Enums.MobileApplicationProfiles.DetailedSetting Then
		Return "DetailedSetting";
	EndIf;
	
EndFunction
